# 微社区的网址
# forum='易班群主页网址'
# forum='易班校方主页网址'
# forum='易班微社区主页网址'
# forum='http://www.yiban.cn/school/index/id/5000089'
forum='http://www.yiban.cn/Org/orglistShow/puid/18396296/group_id/411965/type/forum'

# 每次获取数量
size=500

# 批删除的文件后缀
del_file='xlsx','html','要删除的文件后缀'

# 启用 Excel 保存评论
xlsx=True

# 启用 Excel 保存查询数据
sql_xlsx=True

# 需计数关键词,同一归属方的关键词数会叠加
# 格式 '归属方'：['查找关键词1','查找关键词n',],
count_item={
    '易班技术部':['易流技术','易流'],
    '易班编辑部':['易流技'],
    '材料学院':['魅力材料'],
    '电信学院':['尚学电信'],
    '法学院':['青春法学'],
    '机电学院':['明德机电'],
    '经管学院':['韶华经管'],
    '计通学院':['计通学院'],
    '理学院':['精进理学'],
    '能动学院':['风华能动'],
    '石化学院':['多彩石化'],
    '设计学院':['至美设计'],
    '生命学院':['炫彩生命'],
    '土木学院':['菁华土木'],
    '外语学院':['励志外院'],
    '新能源学院':['新韵能源'],
    '软件学院':['慎微软件'],
}

# 启用内容关键词检索
content=False

# 浏览量最大间隔秒数,可为小数
delay_max=100

# 保存各归属方数据（未实现）
# data=True

# 屏蔽帖（未实现）
# status=1
